package com.javaguru.practices.practice_2.task2;

class Circle {

    /**
     * Необходимо дополнить класс таким образом, чтобы метод (поведение) calculateArea()
     * мог подсчитать площадь круга
     */


    /*
    Состояние объекта
    Необходимо добавить состояние
     */

    /*
    Необходимо дополнить конструктор класса так, чтобы при создании
    объекта менялось его состояние
     */
    public Circle(double radius) {
    }


    /*
    Поведение объекта

    Необходимо переделать поведение объекта
    таким образом, чтобы основываясь на состоянии можно было подсчитать площадь
     */
    double calculateArea() {
        return 0;
    }
}
