package com.javaguru.practices.practice_5.task2;

class Car {
/**
 * Необходимо реализовать класс Car.
 *
 * У класса должно быть состояние.
 *    Поле color типа String
 *    Поле manufacturer типа String
 *
 * Не забывайте про модификатор доступа. Для того, чтобы инкапсулировать состояние класса
 * используйте модификатор доступа private
 *
 * Для того, чтобы иметь возможность контролировать состояние класса нам понадобятся
 * геттеры и сеттеры (getters & setters) для каждого из полей
 *
 * Для того чтобы вывести на консоль информацию о состоянии класса, необходимо переопределить
 * метод toString()
 *
 * Чтобы можно было сравнивать экземпляры класса (объекты) Book по их состоянию, необходимо
 * переопределить метод equals таким образом, чтобы все поля участвовали в сравнении
 */
}
